---
title: PlasticVinyl
classe: Autodesk.Revit.DB.Visual.PlasticVinyl
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# PlasticVinyl

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `PlasticVinyl.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `PlasticVinyl.CommonTintToggle` | String |
| `String PlasticvinylApplication { get; }` | `PlasticVinyl.PlasticvinylApplication` | String |
| `String PlasticvinylBump { get; }` | `PlasticVinyl.PlasticvinylBump` | String |
| `String PlasticvinylBumpAmount { get; }` | `PlasticVinyl.PlasticvinylBumpAmount` | String |
| `String PlasticvinylBumpMap { get; }` | `PlasticVinyl.PlasticvinylBumpMap` | String |
| `String PlasticvinylColor { get; }` | `PlasticVinyl.PlasticvinylColor` | String |
| `String PlasticvinylColorByObject { get; }` | `PlasticVinyl.PlasticvinylColorByObject` | String |
| `String PlasticvinylPattern { get; }` | `PlasticVinyl.PlasticvinylPattern` | String |
| `String PlasticvinylPatternAmount { get; }` | `PlasticVinyl.PlasticvinylPatternAmount` | String |
| `String PlasticvinylPatternMap { get; }` | `PlasticVinyl.PlasticvinylPatternMap` | String |
| `String PlasticvinylType { get; }` | `PlasticVinyl.PlasticvinylType` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```